# -*- coding: utf-8 -*-

# 5 Задание

a = int(input("Введите первое число: "))
b = int(input("Введите второе число: "))
c = int(input("Введите третье число: "))
def minznach(a, b, c):
    return (min(a, b, c))
print("Ответ: ", minznach(a, b, c))

print("\n")