# -*- coding: utf-8 -*-

#7 Задание:
print("7 Задание: ")

number = int(input("Введите число: "))
if number % 2 == 0:
        print('Четное число')
else:
     print('Нечетное число')       